simpleBlog/app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params);
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Brad"], ["body", "Great post!"], ["post_id", 5], ["created_at", "2017-06-20 00:26:20.108063"], ["updated_at", "2017-06-20 00:26:20.108063"]]