app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdofj"], ["description", ";ljl;kasdjf;lkajdslkfj"], ["created_at", "2017-06-21 23:25:36.919800"], ["updated_at", "2017-06-21 23:25:36.919800"]]

    def update
        if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "First Article ever"], ["description", "I am not going to say too much in my first artlcle"], ["updated_at", "2017-06-21 23:58:14.818239"], ["id", 1]]