app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Sunday Menchies Done"], ["updated_at", "2017-06-18 20:48:59.805577"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])

        if (@post.update(params_check))

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first title"], ["body", "sexy body\r\n"], ["created_at", "2017-06-18 18:29:02.391297"], ["updated_at", "2017-06-18 18:29:02.391297"]]
---
    def create
        @post = Post.new(params_check)

        if (@post.save)